import { Component, Input } from '@angular/core';
import { CommonModule } from '@angular/common';
import { CarouselModule } from 'primeng/carousel';
@Component({
  selector: 'lib-slider',
  imports: [CommonModule, CarouselModule],
  templateUrl: './slider.component.html',
  styleUrl: './slider.component.css',
})
export class SliderComponent {
  @Input() slides: any[] = [
    {
      image: '/assets/slider2.png',
      title: `من تراث حضارتنا, نصوغ عقولاً تبني المجد`,
      title2:
        'تسعى جامعة الأقصر إلى تقديم تعليم عالي الجودة، وتعزيز البحث العلمي، وخدمة المجتمع المحلي والدولي، مع الالتزام بالقيم الأخلاقية والحفاظ على التراث الثقافي والحضاري. نحن نؤمن بأهمية تطوير قدرات الطلاب وإعدادهم ليكونوا قادة المستقبل في مختلف المجالات.',
    },

    {
      image: '/assets/slider3.jpg',
      title: `من تراث حضارتنا, نصوغ عقولاً تبني المجد`,
      title2:
        'تسعى جامعة الأقصر إلى تقديم تعليم عالي الجودة، وتعزيز البحث العلمي، وخدمة المجتمع المحلي والدولي، مع الالتزام بالقيم الأخلاقية والحفاظ على التراث الثقافي والحضاري. نحن نؤمن بأهمية تطوير قدرات الطلاب وإعدادهم ليكونوا قادة المستقبل في مختلف المجالات.',
    },

    {
      image: '/assets/slider4.jpg',
      title: `من تراث حضارتنا, نصوغ عقولاً تبني المجد`,
      title2:
        'تسعى جامعة الأقصر إلى تقديم تعليم عالي الجودة، وتعزيز البحث العلمي، وخدمة المجتمع المحلي والدولي، مع الالتزام بالقيم الأخلاقية والحفاظ على التراث الثقافي والحضاري. نحن نؤمن بأهمية تطوير قدرات الطلاب وإعدادهم ليكونوا قادة المستقبل في مختلف المجالات.',
    },
  ];
}
