import { Component } from '@angular/core';
import { NgFor } from "@angular/common";

@Component({
  selector: 'lib-events-section',
  imports: [NgFor],
  templateUrl: './events-section.component.html',
  styleUrl: './events-section.component.css'
})
export class EventsSectionComponent {

  events = [
    {
      title: 'المهمات العلمية في مجال الذكاء',
      description:
        'ترأست الدكتورة مارجريت عبد الجليل، رئيس جامعة الأقصر الاجتماع الدوري للجنة المنشآت الجامعية اليوم الثلاثاء في إطار حرصها على المتابعات المستمرة...',
      date: '21-6-2025',
      time: '04:00 PM',
      location: 'الأقصر، مصر'
    },
    {
      title: 'المهمات العلمية في مجال الذكاء',
      description:
        'ترأست الدكتورة مارجريت عبد الجليل، رئيس جامعة الأقصر الاجتماع الدوري للجنة المنشآت الجامعية اليوم الثلاثاء في إطار حرصها على المتابعات المستمرة...',
      date: '21-6-2025',
      time: '04:00 PM',
      location: 'الأقصر، مصر'
    }
    ,
    {
      title: 'المهمات العلمية في مجال الذكاء',
      description:
        'ترأست الدكتورة مارجريت عبد الجليل، رئيس جامعة الأقصر الاجتماع الدوري للجنة المنشآت الجامعية اليوم الثلاثاء في إطار حرصها على المتابعات المستمرة...',
      date: '21-6-2025',
      time: '04:00 PM',
      location: 'الأقصر، مصر'
    }
    ,
    {
      title: 'المهمات العلمية في مجال الذكاء',
      description:
        'ترأست الدكتورة مارجريت عبد الجليل، رئيس جامعة الأقصر الاجتماع الدوري للجنة المنشآت الجامعية اليوم الثلاثاء في إطار حرصها على المتابعات المستمرة...',
      date: '21-6-2025',
      time: '04:00 PM',
      location: 'الأقصر، مصر'
    }
  ];
}
