import { Component } from '@angular/core';
import { SlicePipe, NgFor } from "@angular/common";

@Component({
  selector: 'lib-news',
  imports: [SlicePipe, NgFor],
  templateUrl: './news.component.html',
  styleUrl: './news.component.css'
})
export class NewsComponent {
newsList = [
    {
      title: 'نحو دمج فعال في مدارسنا - جامعة الأقصر تنظم لقاء تثقيفي لتمكين ذوي الهمم',
      description:
        'ترأست الدكتورة صابرين عبد الجليل، رئيس جامعة الأقصر الاجتماع الدوري للجنة المنشآت الجامعية، اليوم الثلاثاء، في إطار حرصها على المتابعات المستمرة للموقف التنفيذي للمشروعات الجامعية الجاري تنفيذها.',
      date: '12-9-2025'
    },
    {
      title: 'لجنة المنشآت بجامعة الأقصر تناقش الموقف التنفيذي للمشروعات الجامعية',
      description:
        'ترأست الدكتورة صابرين عبد الجليل، رئيس جامعة الأقصر الاجتماع الدوري للجنة المنشآت الجامعية، اليوم الثلاثاء، في إطار حرصها على المتابعات المستمرة للمشروعات الجامعية.',
      date: '12-9-2025'
    },
    {
      title: 'اجتماع مجلس الجامعة برئاسة رئيس الجامعة',
      description:
        'ناقش مجلس الجامعة برئاسة رئيس جامعة الأقصر آخر التطورات الخاصة بالمشروعات البحثية والتعليمية الجديدة في الجامعة.',
      date: '11-9-2025'
    },
    {
      title: 'تعاون دولي جديد بين جامعة الأقصر وعدد من الجامعات العالمية',
      description:
        'وقعت جامعة الأقصر بروتوكول تعاون جديد مع عدد من الجامعات العالمية لتعزيز التعاون البحثي والعلمي.',
      date: '10-9-2025'
    }
  ];
}
