import { Component } from '@angular/core';
import { SlicePipe, NgFor } from "@angular/common";

@Component({
  selector: 'lib-news-ar',
  imports: [SlicePipe, NgFor],
  templateUrl: './news-ar.component.html',
  styleUrl: './news-ar.component.css'
})
export class NewsComponentAr {
newsList = [
  {
    title: 'نحو دمج فعّال في مدارسنا – جامعة الأقصر تنظم لقاءً توعويًا لتمكين ذوي الهمم',
    description:
      'ترأست الأستاذة الدكتورة صابرين عبد الجليل، رئيس جامعة الأقصر، الاجتماع الدوري للجنة المنشآت الجامعية اليوم الثلاثاء، وذلك في إطار حرصها المستمر على متابعة حالة تنفيذ المشروعات الجامعية الجارية.',
    date: '2025-09-12'
  },
  {
    title: 'لجنة منشآت جامعة الأقصر تناقش حالة تنفيذ المشروعات الجامعية',
    description:
      'ترأست الأستاذة الدكتورة صابرين عبد الجليل، رئيس جامعة الأقصر، الاجتماع الدوري للجنة المنشآت الجامعية اليوم الثلاثاء، في إطار متابعتها المستمرة لمشروعات الجامعة.',
    date: '2025-09-12'
  },
  {
    title: 'اجتماع مجلس الجامعة برئاسة رئيس جامعة الأقصر',
    description:
      'ناقش مجلس جامعة الأقصر، برئاسة رئيس الجامعة، آخر التطورات المتعلقة بالمشروعات البحثية والتعليمية الجديدة بالجامعة.',
    date: '2025-09-11'
  },
  {
    title: 'تعاون دولي جديد بين جامعة الأقصر وعدد من الجامعات العالمية',
    description:
      'وقّعت جامعة الأقصر بروتوكول تعاون جديد مع عدد من الجامعات الدولية لتعزيز التعاون العلمي والبحثي.',
    date: '2025-09-10'
  }
];


}
