import { Component } from '@angular/core';
import { NgFor } from "@angular/common";

@Component({
  selector: 'lib-events-section',
  imports: [NgFor],
  templateUrl: './events-section.component.html',
  styleUrl: './events-section.component.css'
})
export class EventsSectionComponent {

events = [
  {
    title: 'بعثات علمية في مجال الذكاء الاصطناعي',
    description:
      'ترأست الأستاذة الدكتورة مارجريت عبد الجليل، رئيس جامعة الأقصر، الاجتماع الدوري للجنة مرافق الجامعة اليوم الثلاثاء، وذلك في إطار حرصها على المتابعة المستمرة...',
    date: '21-6-2025',
    time: '04:00 م',
    location: 'الأقصر، مصر'
  },
  {
    title: 'بعثات علمية في مجال الذكاء الاصطناعي',
    description:
      'ترأست الأستاذة الدكتورة مارجريت عبد الجليل، رئيس جامعة الأقصر، الاجتماع الدوري للجنة مرافق الجامعة اليوم الثلاثاء، وذلك في إطار حرصها على المتابعة المستمرة...',
    date: '21-6-2025',
    time: '04:00 م',
    location: 'الأقصر، مصر'
  },
  {
    title: 'بعثات علمية في مجال الذكاء الاصطناعي',
    description:
      'ترأست الأستاذة الدكتورة مارجريت عبد الجليل، رئيس جامعة الأقصر، الاجتماع الدوري للجنة مرافق الجامعة اليوم الثلاثاء، وذلك في إطار حرصها على المتابعة المستمرة...',
    date: '21-6-2025',
    time: '04:00 م',
    location: 'الأقصر، مصر'
  },
  {
    title: 'بعثات علمية في مجال الذكاء الاصطناعي',
    description:
      'ترأست الأستاذة الدكتورة مارجريت عبد الجليل، رئيس جامعة الأقصر، الاجتماع الدوري للجنة مرافق الجامعة اليوم الثلاثاء، وذلك في إطار حرصها على المتابعة المستمرة...',
    date: '21-6-2025',
    time: '04:00 م',
    location: 'الأقصر، مصر'
  }
];


}
